// FileSyncAgent Localizable.strings

// The name of the product
"FileSyncAgent" = "Filsynkronisering";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Avbryt";

// Text of "Next" button, used in various dialogs
"NEXT" = "Nästa";

// Text of "Done" button, used in various dialogs
"DONE" = "Klar";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Fortsätt";

// The name of iDisk disk image when renamed and moved to the desktop when iDisk syncing is disabled.
// The argument is the user's .Mac name.
// The optional second argument is a counter, for when a .dmg already exists. E.g. "Previous local iDisk for jholt 3.dmg"
"PREVIOUS DMG%"    = "Tidigare lokala iDisk för %@";
"PREVIOUS DMG DIR" = "Tidigare lokala iDisk-enheter";

// These strings are used after migrating a Tiger local iDisk image to Leopard (and later) iDisk syncing  [rdar://6607831]
"MIGRATION_COMPLETE" = "Det finns ett gammalt exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla den eller flytta den till papperskorgen?";
"MIGRATION_DESKTOP"  = "Behåll";
"MIGRATION_TRASH"    = "Flytta till papperskorgen";

// These strings are used to ask the user what to do with old and orphaned local iDisk images from all versions of iDisk syncing.  [rdar://6232713]
// Images can be found on the Desktop (moved there when iDisk syncing has been turned off in the past), as well as ~/Library/Mirrors (Tiger) and ~/Libary/FileSync (Leopard+)
// The code tracks where the images are found and presents three variants depending on where the images are (~/Desktop and/or ~/Library (i.e., INTERNAL)
"CLEANUP_IMAGES_DESK_1"         = "Det finns ett gammalt exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla den eller flytta den till papperskorgen?";
"CLEANUP_IMAGES_INTERNAL_1"     = "Det finns ett gammalt exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla den eller flytta den till papperskorgen?";
"CLEANUP_IMAGES_DESK_MULTI"     = "Det finns flera gamla exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla dem eller flytta dem till papperskorgen?";
"CLEANUP_IMAGES_INTERNAL_MULTI" = "Det finns flera gamla exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla dem eller flytta dem till papperskorgen?";
"CLEANUP_IMAGES_ALL"            = "Det finns flera gamla exemplar av din lokala iDisk på den här datorn som använder %@ hårddiskutrymme. Vill du behålla dem eller flytta dem till papperskorgen?";

"CLEANUP_TITLE_1"     = "En annan kopia av din iDisk hittades på datorn.";
"CLEANUP_TITLE_MULTI" = "Andra kopior av din iDisk hittades på datorn.";

"Keep"  = "Behåll";
"Trash" = "Flytta till papperskorgen";

// ----------------------------------
// "Your iDisk is almost full" dialog

"IDISK ALMOST FULL" = "Din iDisk är nästan full.";

// Text of the "warn again" checkbox.
"DO NOT WARN AGAIN" = "Visa inte den här varningen igen";

// Trash has files, too.
"ALMOST FULL TRASH MSG" = "Det finns filer på iDisk som ligger i papperskorgen. Du kan frigöra utrymme genom att tömma papperskorgen.\n\nDu kan öka storleken på iDisk på %@-panelen i Systeminställningar.";

// No files in trash.
"ALMOST FULL .MAC MSG" = "Du kan öka iDisks storlek på %@-panelen i Systeminställningar.";


// ----------------------------
// "Resizing your iDisk" dialog

"RESIZE IDISK"     = "Storleken på iDisk på datorn måste justeras.";
"RESIZE IDISK MSG" = "Du kan inte använda iDisk på datorn medan dess storlek ändras.";


// ----------------------------------
// "Can't turn off your iDisk" dialog

"CANT DISABLE"          = "Kan inte avaktivera din lokala iDisk.";
"CANT DISABLE BUSY MSG" = "Din lokala iDisk kan inte avaktiveras just nu eftersom den innehåller öppna filer. Stäng filerna och försök igen.";
"CANT DISABLE ERR MSG%" = "Din lokala iDisk kan inte avaktiveras just nu eftersom felet %d inträffade. Försök igen senare.";


// ---------------------------
// "log out / continue" dialog

"LOGOUT BUSY"     = "iDisk synkroniseras. Vill du fortsätta eller logga ut?";
"LOGOUT BUSY MSG" = "Du kan logga ut när iDisk har synkroniserats.";

// Text of the "log out" button.
"LOGOUT" = "Logga ut";

// Text of the "continue" button.
"CONTINUE SYNC" = "Fortsätt att synkronisera";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%qu byte";
"%KB"    = "%.2f K";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// ----------------------------------
// Finder status messages

"Cleaning up..."                 = "Rensar upp…";
"Last sync cancelled."           = "Senaste synkroniseringen avbröts.";
"Finder Settings"                = "Finder-inställningar";				// [rdar://4735199]

// "DM_ACCOUNT_EXPIRED" was "Your %@ account has expired." prior to 10.5.3
"DM_ACCOUNT_EXPIRED"             = "Ditt %@-konto har löpt ut.";
"CREATE FAILED:NIL DMA"          = "Kan inte aktivera iDisk-synkronisering. Kontrollera ditt %@-användarnamn och lösenord på %@-panelen i Systeminställningar.";
"CREATE FAILED:NO USERNAME"      = "Kan inte aktivera iDisk-synkronisering. Kontrollera ditt %@-användarnamn och lösenord på %@-panelen i Systeminställningar.";
"CREATE FAILED:TOO BIG"          = "Kunde inte aktivera iDisk-synkronisering. Din iDisk är större än det tillgängliga lediga utrymmet.";
"CREATE FAILED:UNKNOWN"          = "Kan inte aktivera iDisk-synkronisering. Försök igen senare.";
"Cannot sync more than one computer at a time."	= "En annan dator synkroniserar med det här kontot just nu. Försök igen senare.";
"iDisk syncing unavailable."					= "iDisk-synkronisering är inte tillgänglig just nu. Försök igen senare.";

// Was not localized prior to 10.5.3 (oops!)
"NO_ACTIVE_IDISK"                = "Ditt %@-konto har ingen aktiv iDisk.";
